Repository: runode-dev/runode
Catalog: apps/ios/Runode/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: %@ 在等你回答
en: %@ is waiting for your answer

source: %@做到一半，解决冲突后在电脑上继续或放弃
en: %@ is in progress. Resolve the conflicts, then continue or abort on your Mac.
zh_hant: %@做到一半，解決衝突後在電腦上繼續或放棄

source: %@没成功：%@
en: %@ failed: %@
zh_hant: %@沒成功：%@

source: %@，%@，增加 %u 行，删除 %u 行
en: %@, %@, added lines: %u, removed lines: %u
zh_hant: %@，%@，增加 %u 行，刪除 %u 行

source: %@，稍后自动重连
en: %@, will reconnect automatically
zh_hant: %@，稍後自動重新連線

source: %lld 个会话
en: %lld sessions
zh_hant: %lld 個工作階段

source: %lld 个在干活
en: %lld working
zh_hant: %lld 個在工作

source: %lld 个等你回答
en: %lld waiting for you
zh_hant: %lld 個等你回答

source: %lld 点
en: %lld pt
zh_hant: %lld 點

source: Ctrl（粘住）
en: Ctrl (Sticky)
zh_hant: Ctrl（黏住）

source: Git 操作
en: Git Actions

source: Keychain 出错：%@
en: Keychain error: %@
zh_hant: Keychain 出錯：%@

source: TLS exporter 长度不对
en: Wrong TLS exporter length
zh_hant: TLS exporter 長度不對

source: agent 停下来等你回答时，电脑会经 Apple 的推送服务在灵动岛和锁屏上提醒你，Runode 不用开着；屏幕上的问题文字也会经推送服务转达。
en: When an agent stops to wait for your answer, your Mac alerts you in the Dynamic Island and on the Lock Screen through Apple's push service, even with Runode closed. The question on screen is also sent through the push service.
zh_hant: agent 停下來等你回答時，電腦會經 Apple 的推播服務在動態島和鎖定畫面上提醒你，Runode 不用開著；螢幕上的問題文字也會經推播服務轉達。

source: agent 问你问题时在灵动岛提醒
en: Alert in the Dynamic Island when an agent asks a question
zh_hant: agent 問你問題時在動態島提醒

# agent.blocked.title
source: %@ 在等你回答
en: %@ is waiting for your answer

# git.line.removed
source: 删除
en: Removed
zh_hant: 刪除

# git.status.renamed
source: 改名
en: Renamed
zh_hant: 已重新命名

source: nonce 长度不对
en: Wrong nonce length
zh_hant: nonce 長度不對

source: shell 已退出
en: Shell exited
zh_hant: shell 已結束

source: shell 已退出（退出码 %d）
en: Shell exited (exit code %d)
zh_hant: shell 已結束（結束碼 %d）

source: 「%@」里正在跑的程序会收到 SIGHUP 并退出。
en: Programs running in “%@” will receive SIGHUP and exit.
zh_hant: 「%@」裡正在執行的程式會收到 SIGHUP 並結束。

source: 上
en: Up

source: 上一级
en: Parent Folder
zh_hant: 上一層

source: 上次打开
en: Last Opened
zh_hant: 上次開啟

source: 上次的地址
en: Last Address
zh_hant: 上次的位址

source: 下
en: Down

source: 不在 Git 仓库里
en: Not in a Git repository
zh_hant: 不在 Git 儲存庫裡

source: 丢弃 %@ 的改动？
en: Discard changes in %@?
zh_hant: 捨棄 %@ 的變更？

source: 丢弃 %lld 个文件的改动？
en: Discard changes in %lld files?
zh_hant: 捨棄 %lld 個檔案的變更？

source: 丢弃改动
en: Discard Changes
zh_hant: 捨棄變更

source: 二维码取景框
en: QR code viewfinder
zh_hant: QR 碼取景框

source: 二维码已经过期
en: The QR code has expired
zh_hant: QR 碼已經過期

source: 二维码已经过期，请在电脑上重新生成
en: The QR code has expired. Generate a new one on your Mac.
zh_hant: QR 碼已經過期，請在電腦上重新產生

source: 二进制
en: Binary
zh_hant: 二進位

source: 二进制文件
en: Binary File
zh_hant: 二進位檔案

source: 二进制文件不显示逐行改动。
en: Line-by-line changes aren't shown for binary files.
zh_hant: 二進位檔案不顯示逐行變更。

source: 以列表形式查看
en: View as List
zh_hant: 以清單檢視

source: 以树形式查看
en: View as Tree
zh_hant: 以樹狀檢視

source: 会删掉这部手机上为它保存的设备密钥，以后要重新扫码配对。现在没连着这台电脑，它上面的 agent 等回答时可能还会推送到这部手机，可以在那台电脑上运行 `runode remote revoke %@` 撤销配对。
en: This deletes the device key saved on this phone for it, so you'll need to scan a code to pair again. This phone isn't connected to the Mac right now, so agents there may still send notifications here when they're waiting for an answer. Run `runode remote revoke %@` on that Mac to revoke the pairing.
zh_hant: 會刪掉這部手機上為它儲存的裝置金鑰，之後要重新掃碼配對。現在沒連著這台電腦，它上面的 agent 等回答時可能還會推送到這部手機，可以在那台電腦上執行 `runode remote revoke %@` 撤銷配對。

source: 会删掉这部手机上为它保存的设备密钥，以后要重新扫码配对。电脑上的配对记录要在那台电脑上撤销：运行 `runode remote revoke %@`。
en: This deletes the device key saved on this phone for it, so you'll need to scan a code to pair again. To revoke the pairing record on the Mac, run `runode remote revoke %@` there.
zh_hant: 會刪掉這部手機上為它儲存的裝置金鑰，之後要重新掃碼配對。電腦上的配對紀錄要在那台電腦上撤銷：執行 `runode remote revoke %@`。

source: 会删掉这部手机上为它保存的设备密钥，以后要重新扫码配对。电脑上的配对记录请在那台电脑上撤销。
en: This deletes the device key saved on this phone for it, so you'll need to scan a code to pair again. Revoke the pairing record on the Mac itself.
zh_hant: 會刪掉這部手機上為它儲存的裝置金鑰，之後要重新掃碼配對。電腦上的配對紀錄請在那台電腦上撤銷。

source: 会话
en: Sessions
zh_hant: 工作階段

source: 会话已结束
en: Session ended
zh_hant: 工作階段已結束

source: 保存
en: Save
zh_hant: 儲存

source: 全部取消暂存
en: Unstage All
zh_hant: 全部取消暫存

source: 全部暂存
en: Stage All
zh_hant: 全部暫存

source: 关于
en: About
zh_hant: 關於

source: 关闭
en: Close
zh_hant: 關閉

source: 出错了
en: Something Went Wrong
zh_hant: 出錯了

source: 分离于 %@
en: Detached at %@
zh_hant: 分離於 %@

source: 切换分支
en: Switch Branch
zh_hant: 切換分支

source: 列不出这个目录
en: Couldn't list this folder
zh_hant: 列不出這個目錄

source: 删不掉这台电脑：%@
en: Couldn't delete this Mac: %@
zh_hant: 刪不掉這台電腦：%@

source: 删除
en: Delete
zh_hant: 刪除

source: 删除这台电脑
en: Delete This Mac
zh_hant: 刪除這台電腦

source: 删除这台电脑？
en: Delete this Mac?
zh_hant: 刪除這台電腦？

source: 刷新
en: Refresh
zh_hant: 重新整理

source: 升级电脑上的 runode 后就能在手机上管理 Git。
en: Update runode on your Mac to manage Git from your phone.
zh_hant: 升級電腦上的 runode 後就能在手機上管理 Git。

source: 发送 %@
en: Send %@
zh_hant: 傳送 %@

source: 发送回复
en: Send Reply
zh_hant: 傳送回覆

source: 取消
en: Cancel

source: 取消暂存
en: Unstage
zh_hant: 取消暫存

source: 变基
en: Rebase
zh_hant: 重定基底

source: 只改这部手机上显示的名字。
en: This only changes the name shown on this phone.
zh_hant: 只改這部手機上顯示的名稱。

source: 右
en: Right

source: 合并
en: Merge
zh_hant: 合併

source: 同步
en: Sync

source: 名字
en: Name
zh_hant: 名稱

source: 后台
en: Background
zh_hant: 背景

source: 和电脑上的 Runode 配对，在手机上看 agent 在做什么、回答它们的提问，打开任何一个终端接着干活。
en: Pair with Runode on your Mac to see what your agents are doing, answer their questions, and open any terminal to keep working.
zh_hant: 和電腦上的 Runode 配對，在手機上看 agent 在做什麼、回答它們的提問，打開任何一個終端機接著工作。

source: 响铃时震动
en: Vibrate on Bell
zh_hant: 響鈴時震動

source: 回到 %@
en: Back to %@

source: 回到上次的目录
en: Back to Last Folder
zh_hant: 回到上次的目錄

source: 回到最新
en: Jump to Latest

source: 回复「%@」
en: Reply to “%@”
zh_hant: 回覆「%@」

source: 回车
en: Return
zh_hant: Return

source: 在「%@」里新开终端
en: New Terminal in “%@”
zh_hant: 在「%@」裡新開終端機

source: 在哪台电脑上新开终端？
en: Open a new terminal on which Mac?
zh_hant: 在哪台電腦上新開終端機？

source: 在哪里新开终端？
en: Where to open a new terminal?
zh_hant: 在哪裡新開終端機？

source: 在电脑的终端里运行 `runode remote pair`
en: Run `runode remote pair` in a terminal on your Mac
zh_hant: 在電腦的終端機裡執行 `runode remote pair`

source: 在电脑的终端里运行 `runode remote pair`，屏幕上会出现一个二维码。
en: Run `runode remote pair` in a terminal on your Mac. A QR code appears on its screen.
zh_hant: 在電腦的終端機裡執行 `runode remote pair`，螢幕上會出現一個 QR 碼。

source: 在这里新建
en: Create Here
zh_hant: 在這裡新增

source: 在这里新开终端
en: New Terminal Here
zh_hant: 在這裡新開終端機

source: 在适配手机和跟随电脑之间切换
en: Switch between fitting the phone and following the Mac
zh_hant: 在適應手機和跟隨電腦之間切換

source: 复制目录
en: Copy Folder
zh_hant: 拷貝目錄

source: 好
en: OK

source: 子目录太多，只列出了前面一部分。
en: Too many subfolders; only the first ones are listed.
zh_hant: 子目錄太多，只列出了前面一部分。

source: 字号
en: Font Size
zh_hant: 字級

source: 字号跟随系统
en: Font size follows the system
zh_hant: 字級跟隨系統

source: 字号预览
en: Font size preview
zh_hant: 字級預覽

source: 存不下这台电脑：%@
en: Couldn't save this Mac: %@
zh_hant: 存不下這台電腦：%@

source: 完成
en: Done

source: 宿主断开了连接（%@）
en: The host closed the connection (%@)
zh_hant: 宿主中斷了連線（%@）

source: 对方的证书指纹和配对时的不一样，可能连到了别的设备
en: The certificate fingerprint doesn't match the one from pairing. You may have connected to a different device.
zh_hant: 對方的憑證指紋和配對時的不一樣，可能連到了別的裝置

source: 导不出 TLS exporter
en: Couldn't export TLS exporter
zh_hant: 無法匯出 TLS exporter

source: 尝试太频繁，电脑暂时拒绝了连接，稍后自动重试
en: Too many attempts. The Mac is refusing connections for now; will retry automatically.
zh_hant: 嘗試太頻繁，電腦暫時拒絕了連線，稍後自動重試

source: 尺寸无人控制
en: Size not set by anyone
zh_hant: 尺寸無人控制

source: 尺寸跟随 %@
en: Size set by %@
zh_hant: 尺寸跟隨 %@

source: 尺寸跟随其他设备
en: Size set by another device
zh_hant: 尺寸跟隨其他裝置

source: 尺寸跟随本机
en: Size set by this phone
zh_hant: 尺寸跟隨本機

source: 尺寸跟随电脑
en: Size set by the Mac
zh_hant: 尺寸跟隨電腦

source: 屏幕预览：%@
en: Screen preview: %@
zh_hant: 螢幕預覽：%@

source: 展开
en: Expand
zh_hant: 展開

source: 工作区 %u
en: Workspace %u
zh_hant: 工作區 %u

source: 左
en: Left

source: 已结束
en: ENDED
zh_hant: 已結束

source: 已修改
en: Modified

source: 已删除
en: Deleted
zh_hant: 已刪除

source: 已同步
en: Synced

source: 已和 %@ 配对
en: Paired with %@
zh_hant: 已和 %@ 配對

source: 已展开
en: Expanded
zh_hant: 已展開

source: 已收起
en: Collapsed
zh_hant: 已收合

source: 已断开
en: Disconnected
zh_hant: 已中斷連線

source: 已断开，%lld 秒后重连
en: Disconnected. Reconnecting in %lld seconds
zh_hant: 已中斷連線，%lld 秒後重新連線

source: 已断开，正在重连
en: Disconnected. Reconnecting
zh_hant: 已中斷連線，正在重新連線

source: 已暂存 %lld
en: Staged %lld
zh_hant: 已暫存 %lld

source: 已连接
en: Connected
zh_hant: 已連接

source: 已连接 %@
en: Connected to %@
zh_hant: 已連接 %@

source: 已连接 · %@
en: Connected · %@
zh_hant: 已連接 · %@

source: 已退出
en: Exited
zh_hant: 已結束

source: 干活中
en: Working
zh_hant: 工作中

source: 建不了工作区
en: Couldn't create the workspace
zh_hant: 無法建立工作區

source: 建不了终端：%@
en: Couldn't create the terminal: %@
zh_hant: 無法建立終端機：%@

source: 开不了新终端
en: Couldn't open a new terminal
zh_hant: 無法開啟新終端機

source: 当前分支
en: Current Branch
zh_hant: 目前分支

source: 快捷操作
en: Quick Actions
zh_hant: 快速操作

source: 怎么配对
en: How to Pair
zh_hant: 怎麼配對

source: 我的命令
en: My Commands

source: 或者粘贴配对链接
en: Or paste the pairing link
zh_hant: 或者貼上配對連結

source: 打开
en: Open
zh_hant: 開啟

source: 打开这个终端
en: Open This Terminal
zh_hant: 開啟這個終端機

source: 打开这台电脑上的会话
en: Open Sessions on This Mac
zh_hant: 開啟這台電腦上的工作階段

source: 打开键盘
en: Show Keyboard
zh_hant: 開啟鍵盤

source: 扫码
en: Scan Code
zh_hant: 掃碼

source: 扫终端里的二维码（5 分钟内有效）
en: Scan the QR code in the terminal (valid for 5 minutes)
zh_hant: 掃描終端機裡的 QR 碼（5 分鐘內有效）

source: 找不到这个终端
en: Can't find this terminal
zh_hant: 找不到這個終端機

source: 找不到这台电脑
en: Can't find this Mac
zh_hant: 找不到這台電腦

source: 找不到这台电脑的设备密钥，请删除后重新配对
en: The device key for this Mac is missing. Delete it and pair again.
zh_hant: 找不到這台電腦的裝置金鑰，請刪除後重新配對

source: 拉取
en: Pull
zh_hant: 提取

source: 拣选
en: Cherry-pick
zh_hant: 揀選

source: 拷贝 %@
en: Copy %@
zh_hant: 拷貝 %@

source: 拷贝电脑终端里二维码下面那行链接。
en: Copy the link below the QR code in the terminal on your Mac.
zh_hant: 拷貝電腦終端機裡 QR 碼下面那行連結。

source: 拷贝路径
en: Copy Path
zh_hant: 拷貝路徑

source: 拿不到 TLS 的状态
en: Couldn't get the TLS state
zh_hant: 取不到 TLS 的狀態

source: 推送
en: Push

source: 提交
en: Commit

source: 提交 %lld 个已暂存的文件
en: Commit %lld Staged Files
zh_hant: 提交 %lld 個已暫存的檔案

source: 提交全部 %lld 个改动
en: Commit All %lld Changes
zh_hant: 提交全部 %lld 個變更

source: 提交说明
en: Commit Message
zh_hant: 提交說明

source: 撤销提交
en: Undo Commit
zh_hant: 復原提交

source: 收到的数据格式不对（%@）
en: Received malformed data (%@)
zh_hant: 收到的資料格式不對（%@）

source: 收起
en: Collapse
zh_hant: 收合

source: 收起键盘
en: Hide Keyboard
zh_hant: 收起鍵盤

source: 改不了名字：%@
en: Couldn't change the name: %@
zh_hant: 改不了名稱：%@

source: 切到这个分屏
en: Switch to this pane
zh_hant: 切換到這個分割畫面

source: 分屏
en: Split
zh_hant: 分割畫面

source: 改不了名：%@
en: Couldn't rename: %@
zh_hant: 改不了名稱：%@

source: 改不了名：电脑上的 runode 版本太旧，先升级它。
en: Couldn't rename: runode on your Mac is too old. Update it first.
zh_hant: 改不了名稱：電腦上的 runode 版本太舊，請先升級。

source: 改动 %lld
en: Changes %lld
zh_hant: 變更 %lld

source: 改动太多，只显示了前面一部分。
en: Too many changes; only the first ones are shown.
zh_hant: 變更太多，只顯示了前面一部分。

source: 改名
en: Rename
zh_hant: 重新命名

source: 文件太大，没有读它的内容。
en: The file is too large; its contents weren't read.
zh_hant: 檔案太大，沒有讀取它的內容。

source: 新增
en: Added

source: 新工作区的第一个终端开在这个目录里。
en: The new workspace's first terminal opens in this folder.
zh_hant: 新工作區的第一個終端機開在這個目錄裡。

source: 新建
en: New
zh_hant: 新增

source: 新建工作区
en: New Workspace
zh_hant: 新增工作區

source: 新开一个终端，在手机上就能用。
en: Open a new terminal to use it on your phone.
zh_hant: 新開一個終端機，在手機上就能用。

source: 新开会话
en: New Session
zh_hant: 新開工作階段

source: 新开终端
en: New Terminal
zh_hant: 新開終端機

source: 显示隐藏目录
en: Show Hidden Folders
zh_hant: 顯示隱藏目錄

source: 暂存
en: Stage
zh_hant: 暫存

source: 有冲突
en: Conflicts
zh_hant: 有衝突

source: 未改
en: Unchanged
zh_hant: 未變更

source: 未跟踪
en: Untracked
zh_hant: 未追蹤

source: 未跟踪的文件会从电脑上删掉，丢掉的改动找不回来。已暂存的改动不受影响。
en: Untracked files will be deleted from the Mac, and discarded changes can't be recovered. Staged changes are not affected.
zh_hant: 未追蹤的檔案會從電腦上刪掉，捨棄的變更找不回來。已暫存的變更不受影響。

source: 未连接
en: Not connected
zh_hant: 未連線

source: 本地分支
en: Local Branches
zh_hant: 本機分支

source: 本机
en: this phone
zh_hant: 本機

source: 查看改动
en: View Changes
zh_hant: 查看變更

source: 正在丢弃改动…
en: Discarding changes…
zh_hant: 正在捨棄變更…

source: 正在切换分支…
en: Switching branch…
zh_hant: 正在切換分支…

source: 正在取消暂存…
en: Unstaging…
zh_hant: 正在取消暫存…

source: 正在同步…
en: Syncing…

source: 正在和 %@ 配对…
en: Pairing with %@…
zh_hant: 正在和 %@ 配對…

source: 正在拉取…
en: Pulling…
zh_hant: 正在提取…

source: 正在推送…
en: Pushing…

source: 正在提交…
en: Committing…

source: 正在暂存…
en: Staging…
zh_hant: 正在暫存…

source: 正在获取…
en: Fetching…
zh_hant: 正在擷取…

source: 正在读取仓库…
en: Reading repository…
zh_hant: 正在讀取儲存庫…

source: 正在读取会话…
en: Loading sessions…
zh_hant: 正在讀取工作階段…

source: 正在读取分支…
en: Loading branches…
zh_hant: 正在讀取分支…

source: 正在读取改动…
en: Loading changes…
zh_hant: 正在讀取變更…

source: 正在读取目录…
en: Loading folder…
zh_hant: 正在讀取目錄…

source: 正在连接…
en: Connecting…
zh_hant: 正在連線…

source: 正在重新连接
en: Reconnecting
zh_hant: 正在重新連線

source: 没发出去：%@
en: Not sent: %@
zh_hant: 沒送出去：%@

source: 没有分支
en: No branches
zh_hant: 沒有分支

source: 没有可以尝试的地址
en: No addresses to try
zh_hant: 沒有可以嘗試的位址

source: 没有可显示的内容
en: Nothing to show
zh_hant: 沒有可顯示的內容

source: 没有子目录
en: No subfolders
zh_hant: 沒有子目錄

source: 没有改动了
en: No more changes
zh_hant: 沒有變更了

source: 没有改动，工作区是干净的
en: No changes; the working tree is clean
zh_hant: 沒有變更，工作區是乾淨的

source: 没有相机权限，可以在设置里打开，或者粘贴配对链接
en: Camera access is off. Turn it on in Settings, or paste the pairing link.
zh_hant: 沒有相機權限，可以在設定裡開啟，或者貼上配對連結

source: 没有终端
en: No terminals
zh_hant: 沒有終端機

source: 没有配置远端
en: No remote configured
zh_hant: 沒有設定遠端

source: 滚到这个终端的卡片
en: Scroll to this terminal's card
zh_hant: 捲動到這個終端機的卡片

source: 灵动岛
en: Dynamic Island
zh_hant: 動態島

source: 点上面的按钮打开扫码，对准电脑屏幕上的二维码。配好后电脑就出现在这里。
en: Tap the button above to scan, and point the camera at the QR code on your Mac's screen. Once paired, your Mac appears here.
zh_hant: 點上面的按鈕開啟掃碼，對準電腦螢幕上的 QR 碼。配好後電腦就會出現在這裡。

source: 版本
en: Version

source: 现在在 %@
en: Now in %@
zh_hant: 現在在 %@

source: 现在没连着这台电脑，它上面的 agent 等回答时可能还会推送到这部手机，可以在那台电脑上运行 `runode remote revoke %@` 撤销配对。
en: This phone isn't connected to the Mac right now, so agents there may still send notifications here when they're waiting for an answer. Run `runode remote revoke %@` on that Mac to revoke the pairing.
zh_hant: 現在沒連著這台電腦，它上面的 agent 等回答時可能還會推送到這部手機，可以在那台電腦上執行 `runode remote revoke %@` 撤銷配對。

source: 电脑
en: Mac
zh_hant: 電腦

source: 电脑上提到这部手机时用这个名字，比如终端尺寸由谁决定。下次连上电脑时生效；电脑上已配对设备列表里的名字是配对时的，重新配对后才会更新。留空用系统的名字。
en: This name is used when the Mac refers to this phone, for example to show who sets a terminal's size. It takes effect the next time you connect to the Mac. The name in the Mac's paired devices list is the one from pairing and only updates after you pair again. Leave empty to use the system name.
zh_hant: 電腦上提到這部手機時用這個名稱，比如終端機尺寸由誰決定。下次連上電腦時生效；電腦上已配對裝置清單裡的名稱是配對時的，重新配對後才會更新。留空使用系統的名稱。

source: 电脑上没有打开远程访问
en: Remote access isn't turned on on the Mac
zh_hant: 電腦上沒有開啟遠端存取

source: 电脑上没有窗口在显示这些终端
en: No window on the Mac is showing these terminals
zh_hant: 電腦上沒有視窗在顯示這些終端機

source: 电脑上的 Runode 使用了更新的连接方式（版本 %u），请升级这个 app
en: Runode on your Mac uses a newer connection method (version %u). Update this app.
zh_hant: 電腦上的 Runode 使用了更新的連線方式（版本 %u），請升級這個 app

source: 电脑上的 Runode 升级了，正在重新连接
en: Runode on your Mac was updated. Reconnecting
zh_hant: 電腦上的 Runode 升級了，正在重新連線

source: 电脑上的 Runode 和这个 app 版本不兼容：%@
en: Runode on your Mac isn't compatible with this app version: %@
zh_hant: 電腦上的 Runode 和這個 app 版本不相容：%@

source: 电脑上的 Runode 退出了
en: Runode on your Mac quit
zh_hant: 電腦上的 Runode 結束了

source: 电脑上的 runode 不支持推送，升级后才能提醒
en: runode on your Mac doesn't support push. Update it to get alerts.
zh_hant: 電腦上的 runode 不支援推播，升級後才能提醒

source: 电脑上的 runode 太旧
en: runode on your Mac is too old
zh_hant: 電腦上的 runode 太舊

source: 电脑上的 runode 没开着窗口，建不了工作区，会在这个目录里开一个后台终端。
en: runode on your Mac has no window open, so it can't create a workspace. It will open a background terminal in this folder instead.
zh_hant: 電腦上的 runode 沒開著視窗，無法建立工作區，會在這個目錄裡開一個背景終端機。

source: 电脑关闭了连接
en: The Mac closed the connection
zh_hant: 電腦關閉了連線

source: 电脑名
en: Mac Name
zh_hant: 電腦名稱

source: 电脑拒绝了连接（%@）
en: The Mac refused the connection (%@)
zh_hant: 電腦拒絕了連線（%@）

source: 电脑断开了连接：%@
en: The Mac closed the connection: %@
zh_hant: 電腦中斷了連線：%@

source: 电脑的回应不符合协议：%@
en: The Mac's response doesn't follow the protocol: %@
zh_hant: 電腦的回應不符合通訊協定：%@

source: 登记推送失败：%@
en: Couldn't register for push: %@
zh_hant: 登記推播失敗：%@

source: 目录 %@，%lld 个文件
en: Folder %1$@, %lld files
zh_hant: 目錄 %@，%lld 個檔案

source: 相机不支持识别二维码，请粘贴配对链接
en: This camera can't read QR codes. Paste the pairing link instead.
zh_hant: 相機不支援辨識 QR 碼，請貼上配對連結

source: 确认这是你自己的电脑再配对。
en: Make sure this is your own computer before pairing.
zh_hant: 確認這是你自己的電腦再配對。

source: 空闲
en: Idle
zh_hant: 閒置

source: 窗口 %u
en: Window %u
zh_hant: 視窗 %u

source: 第一条消息不是 remote_challenge
en: The first message wasn't remote_challenge
zh_hant: 第一則訊息不是 remote_challenge

source: 等你回答
en: Waiting for You

source: 签名校验失败，请删除这台电脑后重新配对
en: Signature check failed. Delete this Mac and pair again.
zh_hant: 簽章驗證失敗，請刪除這台電腦後重新配對

source: 粘贴
en: Paste
zh_hant: 貼上

source: 粘贴配对链接
en: Paste Pairing Link
zh_hant: 貼上配對連結

source: 系统设置里关掉了 Runode 的实时活动，打开后才能提醒
en: Live Activities are off for Runode in system Settings. Turn them on to get alerts.
zh_hant: 系統設定裡關掉了 Runode 的即時動態，開啟後才能提醒

source: 终端
en: Terminal
zh_hant: 終端機

source: 终端尺寸
en: Terminal Size
zh_hant: 終端機尺寸

source: 终端尺寸：%@
en: Terminal size: %@
zh_hant: 終端機尺寸：%@

source: 终端选项
en: Terminal Options
zh_hant: 終端機選項

source: 结束
en: End
zh_hant: 終止

source: 结束会话
en: End Session
zh_hant: 終止工作階段

source: 结束这个终端？
en: End this terminal?
zh_hant: 終止這個終端機？

source: 给工作区改名
en: Rename Workspace
zh_hant: 重新命名工作區

source: 网格 %@
en: Grid %@
zh_hant: 格線 %@

source: 自动
en: Auto
zh_hant: 自動

source: 获取
en: Fetch
zh_hant: 擷取

source: 设备名
en: Device Name
zh_hant: 裝置名稱

source: 设备编号
en: Device ID
zh_hant: 裝置編號

source: 设置
en: Settings
zh_hant: 設定

source: 证书指纹
en: Certificate Fingerprint
zh_hant: 憑證指紋

source: 读不了仓库的状态：%@
en: Couldn't read the repository status: %@
zh_hant: 讀不了儲存庫的狀態：%@

source: 读不了分支：%@
en: Couldn't read branches: %@
zh_hant: 讀不了分支：%@

source: 读不了这个文件的改动：%@
en: Couldn't read changes to this file: %@
zh_hant: 讀不了這個檔案的變更：%@

source: 跟随电脑
en: Follow Mac
zh_hant: 跟隨電腦

source: 轻点两下打开键盘
en: Double-tap to show the keyboard
zh_hant: 輕點兩下開啟鍵盤

source: 输入回复，发送时带回车
en: Type a reply; it is sent with Return
zh_hant: 輸入回覆，傳送時帶 Return

source: 运行
en: Run
zh_hant: 執行

source: 运行 · 前台在跑 %@，在新终端里跑
en: Run · %@ is in the foreground, runs in a new terminal
zh_hant: 執行 · 前景在跑 %@，在新終端機裡跑

source: 运行 · 在新终端里跑
en: Run · runs in a new terminal
zh_hant: 執行 · 在新終端機裡跑

source: 运行 · 终端已经结束
en: Run · terminal has ended
zh_hant: 執行 · 終端機已經結束

source: 运行配对命令
en: Run the Pairing Command
zh_hant: 執行配對命令

source: 还没有上游，推送时会设好
en: No upstream yet; it is set when you push
zh_hant: 還沒有上游，推送時會設好

source: 还没有提交
en: No commits yet
zh_hant: 還沒有提交

source: 还没登录就收到了类型 %u 的帧
en: Received a frame of type %u before sign-in
zh_hant: 還沒登入就收到了類型 %u 的訊框

source: 这不是 Runode 的配对链接
en: This isn't a Runode pairing link
zh_hant: 這不是 Runode 的配對連結

source: 这个文件已经没有暂存的改动。
en: This file has no staged changes left.
zh_hant: 這個檔案已經沒有暫存的變更。

source: 这个文件已经没有未暂存的改动。
en: This file has no unstaged changes left.
zh_hant: 這個檔案已經沒有未暫存的變更。

source: 这个文件没有逐行的改动。
en: This file has no line-by-line changes.
zh_hant: 這個檔案沒有逐行的變更。

source: 这个终端已经不在了：%@
en: This terminal is gone: %@
zh_hant: 這個終端機已經不在了：%@

source: 这个终端当前的目录不在 Git 仓库里。在终端里 cd 进仓库后下拉刷新。
en: This terminal's current folder isn't in a Git repository. cd into a repository in the terminal, then pull down to refresh.
zh_hant: 這個終端機目前的目錄不在 Git 儲存庫裡。在終端機裡 cd 進儲存庫後下拉重新整理。

source: 这台电脑上没有终端
en: No terminals on this Mac
zh_hant: 這台電腦上沒有終端機

source: 这台电脑不认识这部手机了：配对可能已在电脑上撤销，请删除后重新配对
en: This Mac no longer recognizes this phone. The pairing may have been revoked on the Mac. Delete it and pair again.
zh_hant: 這台電腦不認識這部手機了：配對可能已在電腦上撤銷，請刪除後重新配對

source: 这台电脑已经删掉了
en: This Mac has been deleted
zh_hant: 這台電腦已經刪掉了

source: 这台设备没有可用的摄像头，请粘贴配对链接
en: This device has no usable camera. Paste the pairing link instead.
zh_hant: 這台裝置沒有可用的相機，請貼上配對連結

source: 这部手机
en: This Phone
zh_hant: 這部手機

source: 远端分支
en: Remote Branches
zh_hant: 遠端分支

source: 连接中…
en: Connecting…
zh_hant: 連線中…

source: 连接你的电脑
en: Connect to Your Mac
zh_hant: 連接你的電腦

source: 连接失败
en: Connection Failed
zh_hant: 連線失敗

source: 连接失败：%@
en: Connection failed: %@
zh_hant: 連線失敗：%@

source: 连接断了，回复可能没送到
en: The connection dropped; your reply may not have been delivered
zh_hant: 連線中斷了，回覆可能沒送到

source: 连接断了，操作可能没办完，重新连上后看看状态
en: The connection dropped; the operation may not have finished. Check the status after reconnecting.
zh_hant: 連線中斷了，操作可能沒完成，重新連上後看看狀態

source: 连接断开：%@
en: Connection lost: %@
zh_hant: 連線中斷：%@

source: 连接超时
en: Connection timed out
zh_hant: 連線逾時

source: 适配手机
en: Fit Phone
zh_hant: 適應手機

source: 通用命令
en: General Commands

source: 配对
en: Pair
zh_hant: 配對

source: 配对信息
en: Pairing Info
zh_hant: 配對資訊

source: 配对口令不对、已过期或已经用过，请在电脑上重新生成二维码
en: The pairing code is wrong, expired, or already used. Generate a new QR code on your Mac.
zh_hant: 配對口令不對、已過期或已經用過，請在電腦上重新產生 QR 碼

source: 配对失败
en: Pairing Failed
zh_hant: 配對失敗

source: 配对失败：%@
en: Pairing failed: %@
zh_hant: 配對失敗：%@

source: 配对新电脑
en: Pair a New Mac
zh_hant: 配對新電腦

source: 配对时间
en: Paired
zh_hant: 配對時間

source: 配对电脑
en: Pair a Mac
zh_hant: 配對電腦

source: 配对链接的版本是 %lld，这个 app 太旧了，请先升级
en: The pairing link is version %lld, which this app is too old to read. Update it first.
zh_hant: 配對連結的版本是 %lld，這個 app 太舊了，請先升級

source: 配对链接里的 %@ 不对
en: %@ in the pairing link is invalid
zh_hant: 配對連結裡的 %@ 不對

source: 配对链接里缺少 %@
en: The pairing link is missing %@
zh_hant: 配對連結裡缺少 %@

source: 里面正在跑的程序会收到 SIGHUP 并退出。
en: Programs running in it will receive SIGHUP and exit.
zh_hant: 裡面正在執行的程式會收到 SIGHUP 並結束。

source: 重新扫码
en: Scan Again
zh_hant: 重新掃碼

source: 重试
en: Retry
zh_hant: 重試

source: 键盘
en: Keyboard
zh_hant: 鍵盤

source: 门禁的回应不对
en: Unexpected response from the gate
zh_hant: 門禁的回應不對

source: 默认尺寸
en: Default Size
zh_hant: 預設尺寸

source: 默认尺寸用在新打开的终端上，终端页右上角还能临时换。「自动」在电脑上没有窗口显示这个终端时适配手机，有时跟随电脑。
en: The default size applies to newly opened terminals; you can also change it temporarily from the top right of the terminal screen. Auto fits the phone when no window on the Mac is showing the terminal, and otherwise follows the Mac.
zh_hant: 預設尺寸用在新開啟的終端機上，終端機頁右上角還能暫時更換。「自動」在電腦上沒有視窗顯示這個終端機時適應手機，有時跟隨電腦。
